<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"sandbox","backend":"09799fa0abaeef91aed134d3f868af3199fa833f26abd5f6986986a549cd757c","plan_job_ref":"Job .github/workflows/_test-tf.yaml #62 at https://github.com/DND-IT/github-workflows/actions/runs/15458027607","plan_out_hash":"9f9f6567f471b5d0a94bb46dfd6eff7fd1aa373ed8ec24afcd68b1fe01b2aa37","plan_hash":"81815fb1eb7b4d3ab101671f54c9518bf7d890b89fc77d9e6503770c3adf4576","plan_text_format":"diff","version":"2.0.1"} -->
Terraform plan for __sandbox__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #62](https://github.com/DND-IT/github-workflows/actions/runs/15458027607)